import {
  factoryMachineImage,
  fountainPenImage,
  paintBucketImage,
  paintPowderImage,
} from "@/lib/images";
import ProductCard from "./ProductCard";

const products = [
  {
    image: paintBucketImage,
    title: "رنگ ها و ضد زنگ ها",
    desc: "در رنگ بیان، ما با افتخار طیف گسترده‌ای از رنگ‌ها و ضد زنگ‌ها را ارائه می‌دهیم که برای حفظ و زیباسازی فضاهای شما طراحی شده‌اند. محصولات ما با بهره‌گیری از فناوری‌های پیشرفته و فرمولاسیون‌های نوآورانه، به شما این امکان را می‌دهند که سطوح مختلف را در برابر عوامل مخرب محیطی محافظت کرده و زیبایی آن‌ها را بهبود ببخشید.",
  },
  {
    image: factoryMachineImage,
    title: "پوشش های صنعتی",
    desc: "در کارخانه ما، به شما پوشش‌های صنعتی با کیفیت برتر و فناوری پیشرفته ارائه می‌دهیم که برای محافظت از تاسیسات و سازه‌های صنعتی در برابر شرایط سخت محیطی و شیمیایی طراحی شده‌اند. محصولات ما با استفاده از بهترین مواد اولیه و فرمولاسیون‌های نوآورانه تولید می‌شوند تا اطمینان حاصل شود که سطوح شما نه تنها در برابر خوردگی، سایش و ترک‌خوردگی مقاوم هستند، بلکه زیبایی آن‌ها نیز حفظ شود.",
  },
  {
    image: fountainPenImage,
    title: "پیگمنت پایه آب (جوهر)",
    desc: "رنگ بیان افتخار دارد که پیگمنت‌های پایه آب با کیفیت عالی را به شما ارائه دهد، که راه‌حلی ایده‌آل برای ایجاد رنگ‌های زنده و پایدار با حداقل تأثیر بر محیط زیست است. این جوهرها، که برای استفاده در طیف وسیعی از کاربردهای صنعتی و هنری طراحی شده‌اند، نه تنها کیفیت و دوام بالایی را ارائه می‌دهند، بلکه به کاهش انتشار مواد مضر به محیط زیست نیز کمک می‌کنند.",
  },
  {
    image: paintPowderImage,
    title: "پودر های رنگی",
    desc: "پودر های رنگی با کیفیت بالا برای ایجاد جلوه‌های بصری جذاب و رنگارنگ. این پودرها در طیف گسترده‌ای از رنگ‌ها موجود هستند و برای انواع پروژه‌های هنری، تزئینی و صنعتی مناسب می‌باشند. با استفاده از پودر های رنگی، می‌توانید به طراحی‌ها و آثار خود زندگی و انرژی ببخشید. از ویژگی‌های بارز این پودرها می‌توان به رنگ‌های زنده، پوشش دهی عالی و سهولت در استفاده اشاره کرد.",
  },
];

export default function Products() {
  return (
    <section
      id="products"
      className="mx-auto flex w-full flex-col items-center justify-center gap-24 px-8 md:max-w-7xl"
    >
      {products.map(({ image, title, desc }) => (
        <ProductCard key={title} image={image} title={title} desc={desc} />
      ))}
    </section>
  );
}
